#!/usr/bin/env python
# -*- coding: utf-8 -*-

# есть список животных в зоопарке

zoo = ['lion', 'kangaroo', 'elephant', 'monkey']

# посадите медведя (bear) между львом и кенгуру
#  и выведите список на консоль


# добавьте птиц из списка birds в последние клетки зоопарка
birds = ['rooster', 'ostrich', 'lark']
#  и выведите список на консоль


# уберите слона
#  и выведите список на консоль
# zoo.remove('elephant')


#  уберите слона не по значению remove('elephant'), а через удаление по индексу .pop()

# выведите на консоль в какой клетке сидит лев (lion) и жаворонок (lark).
# Номера при выводе должны быть понятны простому человеку, не программисту.

#  №1. Вывод через запятую.
#       name = 'Форрест Гамп'
#       age = 25
#       print('Мое имя — ', name, '. Люди зовут меня ', name, '. Мне ', age)        # просто через запятую перечисляем
#  .
#  №2. Вывод с использованием .format (это вы изучите в 6ом модуле).
#       print('Мое имя — {}. Люди зовут меня {}. Мне {}.'.format(name, name, age))  # вместо {} будут подставлены
#                                                                                   # переменные name, name, age.
#  .
#  №3. f-strings (или f-строки) (это вы тоже изучите в 6ом модуле)
#       print(f'Мое имя — {name}. Люди зовут меня {name}. Мне {age}.')
#  Строка начинается с f'' (поэтому и f-строки). В места, где нужно подставить переменную мы пишем: {<<имя переменной>>}
#  .
#  .
#  Сделайте через f-строку. Самый быстрый (по скорости работы) и современный.

